import React from 'react'
import styles from './Origin.module.css'

const Origin = () => {
  return (
    <section id={styles.Origin}>
      <div className={styles.Origin}>
        <h1 className={styles.title}>ความเป็นมา</h1>
        <div className={styles.Main_About}>
          <div className={styles.section}>
            <h1>เกี่ยวกับ ห้องเรียน <span className={styles.HL1}>E-sports</span></h1>
            <div className={styles.doc}>
              <p>
                เพราะทักษะแห่งโลกอนาคตไม่ได้หยุดอยู่แค่ในห้องเรียน ห้องเรียน <span className={styles.HL1}>E-sports</span> จึงเป็นโครงการที่ออกแบบมาสำหรับเยาวชนรุ่นใหม่ที่จะช่วยส่งเสริมความสามารถและพัฒนาทักษะต่าง ๆ ที่จำเป็นในโลกดิจิทัล โดยมุ่งเน้นการให้ความรู้ด้านอาชีพในอุตสาหกรรมเกมและเรา <span className={styles.HL2}>โรงเรียนสระบุรีวิทยาคม</span> จะการสร้างความเข้าใจเกี่ยวกับอาชีพและเตรียมความพร้อมให้ผู้ที่มีความสนใจสามารถเข้าสู่ภาคธุรกิจและตลาดแรงงานได้ในอนาคต
              </p>
              <p>
                นักเรียนและคุณครูที่เข้าร่วมโครงการจะได้เข้ารับการอบรมเพื่อพัฒนาทักษะและความรู้กับผู้เชี่ยวชาญจากอุตสาหกรรมเกมและอีสปอร์ต ดังนี้
                <ul className={styles.part1}>
                  <li>ผู้ประสานโครงการแข่งขัน <span className={styles.HL1}>E-sports</span></li>
                  <li>ทีมโค้ชผู้ฝึกสอนกีฬาอีสปอร์ต</li>
                  <li>ทีมนักพากย์</li>
                  <li>ทีมสื่อวงการเกมส์</li>
                  <li>ทีมควบคุมสื่อและการถ่ายทอดสด</li>
                </ul>
              </p>
              <p>
                นอกจากนี้ เมื่อนักเรียนและคุณครูได้รับการอบรม และพัฒนาทักษะในอุตสาหกรรมเกมและอีสปอร์ตเสร็จสิ้นแล้วนั้น จะได้มีโอกาสจัดการแข่งขันกีฬาอีสปอร์ตภายในโรงเรียน และการแข่งขันระหว่างโรงเรียน
              </p>
            </div>
          </div>

          <div>
            <h1>คําอธิบายรายวิชา <span className={styles.HL1}>E-sports</span></h1>
            <div className={styles.doc}>
              <p>
                วิชาห้องเรียนอีสปอร์ตเปนวิชาทีศึกษาเกียวกับการจัดการแข่งขันกีฬาอีสปอร์ต หรือ <span className={styles.HL2}>E-sports Tournament</span>  โดยผู้เรียนจะสามารถเรียนรู้ทักษะการทํางานทังเบืองหน้าและเบืองหลังในการจัดการแข่งขันกีฬาอีสปอร์ต โดย  มุ่งเน้นการ
                เรียนรู้เกียวกับการวางแผน การจัดการแข่งขัน การเปนโค้ชกีฬาอีสปอร์ต การเปนนักพากย์กีฬาอีสปอร์ต การทําหน้าทีสือใน
                วงการอีสปอร์ต การถ่ายทอดสดการแข่งขันกีฬาอีสปอร์ตรวมทังการได้ลงมือปฏิบัติในการจัดการแข่งขันกีฬาอีสปอร์ตเพือ
                สร้างแรงบันดาลใจและสร้างพืนทีเพือให้นักเรียนได้พัฒนาตัวเองได้สนใจอุตสาหกรรมเกมและอีสปอร์ตอีกทังส่งเสริมให้
                นักเรียนได้ฝกทักษะการจัดการทีมพร้อมประยุกต์ความรู้และทักษะจากหน่วยการเรียนรู้ต่าง ๆ มาปรับใช้ในสถานการ์ณจริง
              </p>
              <div className={styles.in_doc}>
                <h2>ผลการเรียนรู้</h2>
                <ul className={styles.part2}>
                  <li>ได้เรียนรู้ประวัติและความเป็นมาของกีฬาอีสปอร์ต</li>
                  <li>สามารถวิเคราะห์รูปแบบธุรกิจกีฬาอีสปอร์ต</li>
                  <li>ได้เสริมสร้างปฏิสัมพันธ์ที่ดีต่อเพื่อนร่วมชั้น</li>
                  <li>ได้เรียนรู้บทบาทและทักษะผู้ประสานงานโครงการแข่งขันกีฬาอีสปอร์ต</li>
                  <li>สามารถพัฒนากระบวนการคิดวางแผน ทักษะการทำงานเป็นทีมและการสื่อสารเพื่อการประสานงาน</li>
                  <li>สามารถวิเคราะห์หน้าที่ คุณสมบัติ ความรู้และความสำคัญของตำแหน่งโค้ชกีฬาอีสปอร์ต</li>
                  <li>ตระหนักถึงทักษะที่สำคัญต่อการเตรียมตัวเป็นโค้ชที่ดี ที่ส่งเสริมความมั่นใจในการเล่น สนับสนุนการวางแผน และวิเคราะห์ภาพรวมเกม</li>
                  <li>ได้เรียนรู้บทบาทและความสำคัญของอาชีพนักพากย์</li>
                  <li>ได้ตระหนักถึงทักษะการเป็นนักพากย์กีฬาอีสปอร์ต</li>
                  <li>ได้เรียนรู้กระบวนการผลิตสื่ออย่างสร้างสรรค์ (Content Creator)</li>
                  <li>ฝึกปฏิบัติทักษะการเขียน การสัมภาษณ์และการออกแบบสื่ออย่างสร้างสรรค์</li>
                  <li>ได้ฝึกปฏิบัติทักษะการจัดการสื่อเพื่อการถ่ายทอดสดระบบออนไลน์</li>
                  <li>สามารถเปรียบเทียบคุณสมบัติของเทคโนโลยีที่ถ่ายทอดสดการแข่งขันรูปแบบต่าง ๆ ทั้งออนไลน์และออฟไลน์</li>
                  <li>ได้ฝึกปฏิบัติทักษะการเตรียมการแข่งขันกีฬาอีสปอร์ต</li>
                  <li>ได้ฝึกทักษะวางแผนและทักษะแก้ปัญหา</li>
                  <li>ได้ฝึกประสบการณ์การจัดการแข่งขันกีฬาอีสปอร์ต</li>
                  <li>สามารถสะท้อนผลการเรียนรู้กิจกรรมห้องเรียนกีฬาอีสปอร์ต</li>
                  <li>ได้พัฒนาทักษะสื่อสารและความเข้าใจตนเอง</li>
                </ul>
              </div>

            </div>
          </div>
        </div>
      </div>
    </section>
  )
}

export default Origin